duvallee/drone_transmitter_bt_nrf51822/nrf51_uart_peripheral/main.c
// struct for SPEKTRUM 1024 Protocol
typedef struct _RX_PACKET_SPEKTRUM_1024
{
   uint8_t fades;
   uint8_t system;
   uint16_t channel[MAX_SPEKTRUM_CHANNEL_NUM];
} __attribute__ ((__packed__)) RX_PACKET_SPEKTRUM_1024;

/******************************************************************
 *
 * Function Name : bt_packet_to_fc_packet()
 *   covert packet of bt to packet of fc 
 *
 ******************************************************************/
static int bt_packet_to_fc_packet(uint16_t* p_bt_channel_info, uint8_t bt_channel_count, void* p_fc_packet, uint8_t* p_fc_acket_size)
{
   int bt_channel_index;
   int spektrum_channel_index;
   RX_PACKET_SPEKTRUM_1024* pRxPacketSpektrum1024        = (RX_PACKET_SPEKTRUM_1024*) p_fc_packet;
   if (*p_fc_acket_size < sizeof(RX_PACKET_SPEKTRUM_1024))
   {
      return -1;
   }

   // packet size of SPEKTRUM 1024
   *p_fc_acket_size                                      = sizeof(RX_PACKET_SPEKTRUM_1024);

   // header of spektrum's 1024
   pRxPacketSpektrum1024->fades                          = 0x0;
   pRxPacketSpektrum1024->system                         = SPEKTRUM_DSM2_22MS;

   for (bt_channel_index = 0, spektrum_channel_index = 0;
        bt_channel_index < bt_channel_count && spektrum_channel_index < MAX_SPEKTRUM_CHANNEL_NUM;
        bt_channel_index++, spektrum_channel_index++)
   {
      pRxPacketSpektrum1024->channel[spektrum_channel_index] = (SPEKTRUM_1024_CHANID_MASK & (p_bt_channel_info[bt_channel_index] >> 2)) |
                                                               (SPEKTRUM_1024_SXPOS_MASK & p_bt_channel_info[bt_channel_index]);
   }
   return 0;
}

// -----------------------------------------------------------------------------
// default value for failsafe mode ...
static FAILSAFE_MODE_VALUE g_failsafe_value[SPEKTRUM_MAX_CHANNEL] =
{
   { (SPEKTRUM_CHANNEL_ROLL << SPEKTRUM_1024_CHANNEL_SHIFT_BITS),      512},
   { (SPEKTRUM_CHANNEL_PITCH << SPEKTRUM_1024_CHANNEL_SHIFT_BITS),     512},
   { (SPEKTRUM_CHANNEL_YAW << SPEKTRUM_1024_CHANNEL_SHIFT_BITS),       512},
   { (SPEKTRUM_CHANNEL_THROTTLE << SPEKTRUM_1024_CHANNEL_SHIFT_BITS),  100},
   { (SPEKTRUM_CHANNEL_GEAR << SPEKTRUM_1024_CHANNEL_SHIFT_BITS),      100},
   { (SPEKTRUM_CHANNEL_AUX_1 << SPEKTRUM_1024_CHANNEL_SHIFT_BITS),     512},
   { (SPEKTRUM_CHANNEL_AUX_2 << SPEKTRUM_1024_CHANNEL_SHIFT_BITS),     512},
   { (SPEKTRUM_CHANNEL_AUX_3 << SPEKTRUM_1024_CHANNEL_SHIFT_BITS),     512},
   { (SPEKTRUM_CHANNEL_AUX_4 << SPEKTRUM_1024_CHANNEL_SHIFT_BITS),     512},
   { (SPEKTRUM_CHANNEL_AUX_5 << SPEKTRUM_1024_CHANNEL_SHIFT_BITS),     512},
   { (SPEKTRUM_CHANNEL_AUX_6 << SPEKTRUM_1024_CHANNEL_SHIFT_BITS),     512},
   { (SPEKTRUM_CHANNEL_AUX_7 << SPEKTRUM_1024_CHANNEL_SHIFT_BITS),     512},
};

/******************************************************************
 *
 * Function Name : bt_packet_to_fc_packet()
 *   covert packet of bt to packet of fc 
 *
 ******************************************************************/
static int default_fc_packet(void* p_fc_packet, uint8_t* p_fc_acket_size)
{
   int i;
   RX_PACKET_SPEKTRUM_1024* pRxPacketSpektrum1024        = (RX_PACKET_SPEKTRUM_1024*) p_fc_packet;
   if (*p_fc_acket_size < sizeof(RX_PACKET_SPEKTRUM_1024))
   {
      return -1;
   }

   // packet size of SPEKTRUM 1024
   *p_fc_acket_size                                      = sizeof(RX_PACKET_SPEKTRUM_1024);

   // header of spektrum's 1024
   pRxPacketSpektrum1024->fades                          = 0x0;
   pRxPacketSpektrum1024->system                         = SPEKTRUM_DSM2_22MS;

   for (i = 0; i < MAX_SPEKTRUM_CHANNEL_NUM; i++)
   {
      pRxPacketSpektrum1024->channel[i]                  = (g_failsafe_value[i].channel_id | g_failsafe_value[i].value);
   }
   return 0;
}



// -----------------------------------------------------------------------------
#elif defined(SERIAL_RX_SPEKTRUM_2048)

// -----------------------------------------------------------------------------
#elif defined(SERIAL_RX_S_BUS)

// -----------------------------------------------------------------------------
#elif defined(SERIAL_RX_SUMD)

// -----------------------------------------------------------------------------
#elif defined(SERIAL_RX_SUMH)

// -----------------------------------------------------------------------------
#elif defined(SERIAL_RX_MODE_B)

// -----------------------------------------------------------------------------
#elif defined(SERIAL_RX_MODE_B_BJ01)

// -----------------------------------------------------------------------------
#elif defined(SERIAL_RX_IBUS)

// -----------------------------------------------------------------------------
#elif defined(SERIAL_RX_MSP)

// -----------------------------------------------------------------------------
#else
#error "Not supported"
#endif      // SERIAL_RX_SPEKTRUM_1024
#endif      // SERIAL_RECEIVER

/******************************************************************
 *
 * Function Name : timer_send_msg_to_fc_controller()
 *
 *
 ******************************************************************/
#define UART_RETRY_SEND_COUNT                            1
static void timer_send_msg_to_fc_controller(void* pdata)
{
   int i;
   int retry_count                                       = 0;
   if (gProject->internal_tx_packet_size > 0)
   {
      memcpy(gProject->fc_tx_buffer, gProject->internal_tx_buffer, gProject->internal_tx_packet_size);
      gProject->fc_tx_packet_size                        = gProject->internal_tx_packet_size;
      gProject->internal_tx_packet_size                  = 0;
   }
   for (i = 0; i < (gProject->fc_tx_packet_size); i++)
   {
      retry_count                                        = 0;
      while(app_uart_put(gProject->fc_tx_buffer[i]) != NRF_SUCCESS)
      {
         if (UART_RETRY_SEND_COUNT < retry_count++)
         {
            return;
         }
      }
   }
}

/******************************************************************
 *
 * Function Name : timer_bt_command_parser()
 *
 *
 ******************************************************************/
static void timer_bt_command_parser(void* pdata)
{
   BT_PROTOCOL_COMMAND* pbtProtocolCommand               = NULL;
   BT_PROTOCOL_COMMAND* pbtProtocolResponse              = NULL;
   BT_PROTOCOL_DATA* pbtProtocolChannelData              = NULL;
   uint8_t rx_data_length                                = gProject->received_rx_length;

   if (gProject->parsing_status != 0)
   {
      return;
   }

   if (gProject->received_rx_length > 0)
   {
      pbtProtocolCommand                                 = (BT_PROTOCOL_COMMAND*) gProject->bt_rx_buffer;
      pbtProtocolResponse                                = (BT_PROTOCOL_COMMAND*) gProject->bt_tx_buffer;

      gProject->parsing_result_code                      = SUCCESS_RESPONSE;
      gProject->parsing_status                           = 1;
      gProject->received_rx_length                       = 0;

      pbtProtocolResponse->version_high                  = PROTOCOL_HEADER_HIGH_VERSION;
      pbtProtocolResponse->version_low                   = PROTOCOL_REGISTER_RESPONSE;

