duvallee/drone_transmitter_bt_nrf51822/nrf51_uart_peripheral/main.c
      pbtProtocolResponse->size                          = PROTOCOL_BASIC_MAX_SIZE;

      // error code
      pbtProtocolResponse->option_1_high                 = 0;
      pbtProtocolResponse->option_1_low                  = SUCCESS_RESPONSE;

      // reserved
      pbtProtocolResponse->option_2_high                 = 0;
      pbtProtocolResponse->option_2_low                  = 0;


      switch (pbtProtocolCommand->command)
      {
         case PROTOCOL_REGISTER_MESSAGE :
            pbtProtocolResponse->command                 = PROTOCOL_REGISTER_RESPONSE;

            // check internal packet size
            if (rx_data_length != PROTOCOL_BASIC_MAX_SIZE)
            {
               gProject->parsing_result_code             = ERROR_INTERNAL_PACKET_SIZE;

               // error code
               pbtProtocolResponse->option_1_high        = 0;
               pbtProtocolResponse->option_1_low         = ERROR_INTERNAL_PACKET_SIZE;
               return;
            }

            // check packet size
            if (pbtProtocolCommand->size != PROTOCOL_BASIC_MAX_SIZE)
            {
               gProject->parsing_result_code             = ERROR_PACKET_SIZE;

               // error code
               pbtProtocolResponse->option_1_high        = 0;
               pbtProtocolResponse->option_1_low         = ERROR_PACKET_SIZE;
               return;
            }
            break;

         case PROTOCOL_ALIVE_MESSAGE :
            pbtProtocolResponse->command                 = PROTOCOL_ALIVE_RESPONSE;

            // check internal packet size
            if (rx_data_length != PROTOCOL_BASIC_MAX_SIZE)
            {
               gProject->parsing_result_code             = ERROR_INTERNAL_PACKET_SIZE;

               // error code
               pbtProtocolResponse->option_1_high        = 0;
               pbtProtocolResponse->option_1_low         = ERROR_INTERNAL_PACKET_SIZE;
               return;
            }

            // check packet size
            if (pbtProtocolCommand->size != PROTOCOL_BASIC_MAX_SIZE)
            {
               gProject->parsing_result_code             = ERROR_PACKET_SIZE;

               // error code
               pbtProtocolResponse->option_1_high        = 0;
               pbtProtocolResponse->option_1_low         = ERROR_PACKET_SIZE;
               return;
            }
            break;
            break;

         case PROTOCOL_CHANNEL_MESSAGE :
            pbtProtocolResponse->command                 = PROTOCOL_UNKNOWN_RESPONSE;

            // check internal packet size
            if (rx_data_length != PROTOCOL_CHANNEL_MAX_SIZE)
            {
               gProject->parsing_result_code             = ERROR_INTERNAL_PACKET_SIZE;

               // error code
               pbtProtocolResponse->option_1_high        = 0;
               pbtProtocolResponse->option_1_low         = ERROR_INTERNAL_PACKET_SIZE;
               return;
            }

            // check packet size
            if (pbtProtocolCommand->size != PROTOCOL_CHANNEL_MAX_SIZE)
            {
               gProject->parsing_result_code             = ERROR_PACKET_SIZE;

               // error code
               pbtProtocolResponse->option_1_high        = 0;
               pbtProtocolResponse->option_1_low         = ERROR_PACKET_SIZE;
               return;
            }
            break;

         default :
            gProject->parsing_result_code                = ERROR_UNKNOWN_COMMAND;
            pbtProtocolResponse->command                 = PROTOCOL_UNKNOWN_RESPONSE;

            // error code
            pbtProtocolResponse->option_1_high           = 0;
            pbtProtocolResponse->option_1_low            = ERROR_UNKNOWN_COMMAND;
            return;
      }


      if (pbtProtocolCommand->version_high != PROTOCOL_HEADER_HIGH_VERSION)
      {
         gProject->parsing_result_code                   = ERROR_RESPONSE_VERSION;

         // error code
         pbtProtocolResponse->option_1_high              = 0;
         pbtProtocolResponse->option_1_low               = ERROR_RESPONSE_VERSION;
         return;
      }

      if (pbtProtocolCommand->version_low != PROTOCOL_HEADER_LOW_VERSION)
      {
         gProject->parsing_result_code                   = ERROR_RESPONSE_VERSION;

         // error code
         pbtProtocolResponse->option_1_high              = 0;
         pbtProtocolResponse->option_1_low               = ERROR_RESPONSE_VERSION;
         return;
      }

      switch (pbtProtocolCommand->command)
      {
         case PROTOCOL_REGISTER_MESSAGE :
            if (gProject->register_client != 0)
            {
               gProject->parsing_result_code             = ERROR_ALREADY_REGISTERED;

               // error code
               pbtProtocolResponse->option_1_high        = 0;
               pbtProtocolResponse->option_1_low         = ERROR_ALREADY_REGISTERED;
               return;
            }
            else
            {
               // register client
               gProject->register_client                 = 1;
               app_timer_cnt_get(&gProject->last_alive_tick_count);
               return;
            }
            break;

         case PROTOCOL_ALIVE_MESSAGE :
            gProject->client_alive_count                 = (pbtProtocolCommand->option_1_high << 24) |
                                                           (pbtProtocolCommand->option_1_low  << 16) |
                                                           (pbtProtocolCommand->option_2_high << 8) |
                                                           (pbtProtocolCommand->option_1_low);
            app_timer_cnt_get(&gProject->last_alive_tick_count);
            return;

         case PROTOCOL_CHANNEL_MESSAGE :
            pbtProtocolChannelData                       = (BT_PROTOCOL_DATA*) gProject->bt_rx_buffer;
            gProject->internal_tx_packet_size            = SERIAL_RX_TRANSMITTER_MAX_SIZE;
            if (bt_packet_to_fc_packet(&(pbtProtocolChannelData->channel_1), SPEKTRUM_MAX_CHANNEL,
                                       (void*) gProject->internal_tx_buffer, &gProject->internal_tx_packet_size) < 0)
            {
            }
            app_timer_cnt_get(&gProject->last_alive_tick_count);
            SET_PROJECT_NORMAL_STATUS(gProject->mode);
            return;

         default :
            gProject->parsing_result_code                = ERROR_UNKNOWN_COMMAND;

            // result code
            pbtProtocolResponse->option_1_high           = 0;
            pbtProtocolResponse->option_1_low            = ERROR_UNKNOWN_COMMAND;
            return;
      }
   }
   return;
}

/******************************************************************
 *
 * Function Name : timer_bt_response()
 *
 *
 ******************************************************************/
static void timer_bt_response(void* pdata)
{
   uint32_t err_code;

   if (gProject->parsing_status != 0)
   {
      return;
   }

   err_code                                              = ble_nus_string_send(&m_nus, gProject->bt_tx_buffer, PROTOCOL_BASIC_MAX_SIZE);
   if (err_code != NRF_SUCCESS)
   {
   }
   gProject->parsing_status                              = 0;
}

/******************************************************************
 *
 * Function Name : timer_failsafe_mode()
 *
 *
 ******************************************************************/
static void timer_failsafe_mode(void* pdata)
{
   uint32_t diff_tick_count                              = 0;
   uint32_t cur_tick_count                               = 0;

